СкладГП/src/InformationRegisters/ИсторияРаботы/ИсторияРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияРаботы</name>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СкладГП/src/CommonModules/СлужебныйОбновлениеВызовСервера/Module.bsl
Процедура ЗаполнитьОбновитьПреопределенныйНастройки() Экспорт
	СлужебныйОбновление.ЗаполнитьОбновитьПреопределенныйНастройки();
	НЗ = РегистрыСведений.ИсторияРаботы.СоздатьНаборЗаписей();
	НЗ.Записать(ИСТИНА);
КонецПроцедуры

Функция ДатаПоследнегоОбновления(ИмяФункции) ЭКспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ИсторияРаботы.ДатаСобытия) КАК ДатаСобытия
	|ИЗ
	|	РегистрСведений.ИсторияРаботы КАК ИсторияРаботы
	|ГДЕ
	|	ИсторияРаботы.ИмяСобытия = &ИмяСобытия
	|	И НЕ ИсторияРаботы.Ошибка";
	Запрос.УстановитьПараметр("ИмяСобытия", ИмяФункции);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаСобытия;
	Иначе
		Возврат Дата(1,1,1);	
	КонецЕсли;
	
КонецФункции

Функция ФоновоеОбновлениеОстатковСклада(Ячейка = Неопределено, МассивПакетов = Неопределено) Экспорт
	
	ИмяМетода = "СлужебныйОбновление.ОбновитьОстаткиПакетовНаСкладе";
	
	Если ДлительныеОперации.ФоновоеЗаданиеАктивно(ИмяМетода) Тогда
		Возврат НЕОПРЕДЕЛЕНО;
	Иначе
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(Ячейка);
		ПараметрыЗадания.Добавить(МассивПакетов);
		Возврат ФоновыеЗадания.Выполнить(ИмяМетода,	ПараметрыЗадания, ИмяМетода,	 "Обновление остатков склада").УникальныйИдентификатор;
		
	КонецЕсли;
КонецФункции 

Функция ОбновлениеОстатковСклада(Ячейка = Неопределено, МассивПакетов = Неопределено) Экспорт
	
	СлужебныйОбновление.ОбновитьОстаткиПакетовНаСкладе(Ячейка, МассивПакетов);	
	
КонецФункции

Функция НачатьОбменФоново(КоличествоЗаписейВПакете = 1000) Экспорт
	
	ИмяМетода = "СлужебныйОбновление.НачатьОбменИзменениями";
	
	Если НЕ ДлительныеОперации.ФоновоеЗаданиеАктивно(ИмяМетода) Тогда
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(КоличествоЗаписейВПакете);
		ФоновыеЗадания.Выполнить(ИмяМетода,	ПараметрыЗадания, ИмяМетода, "Выгрузка изменений");
		
	КонецЕсли;
КонецФункции

Функция СостояниеФоновогоЗадания(ФЗ) Экспорт
	
	Возврат Строка(ФЗ.СостояниеФоновогоЗадания);
		
КонецФункции

Функция НачатьОбменИзменениями(КоличествоЗаписейВПакете = 1000, ТипДанныхВыгрузки = "") Экспорт
	
	Если ДлительныеОперации.ФоновоеЗаданиеАктивно("СлужебныйОбновление.НачатьОбменИзменениями") Тогда
		Возврат НЕОПРЕДЕЛЕНО;
	КонецЕсли; 
	
	Возврат СлужебныйОбновление.НачатьОбменИзменениями(КоличествоЗаписейВПакете, ТипДанныхВыгрузки);
	
КонецФункции

Процедура ОбновитьНСИ(Фоново) Экспорт
	СлужебныйОбновление.ОбновитьСлужебныеСправочники(Фоново);
КонецПроцедуры

Процедура ОбновитьСлужебныеСправочники(Фоново = ИСТИНА) Экспорт
	СлужебныйОбновление.ОбновитьСлужебныеСправочники(Фоново);
КонецПроцедуры
